# Agenda: Dates and times

1. Core concepts and data structures
2. Parsing of dates and times
3. Using `.dt`
4. Comparisons and the like
5. Timedelta, and comparisons with it
6. Grouper
7. Time series
8. Resampling

# Concepts

- `datetime` or `timestamp` -- unique point in time, with year, month, day, hour, minute, second, etc.
- `timedelta` or `interval` -- range of time, measured in seconds, minutes, days

Date math:
- `datetime` - `datetime` = `timedelta`
- `datetime` + `timedelta` = `datetime`
- `datetime` - `timedelta` = `datetime`

In [1]:
import pandas as pd

filename = 'taxi.csv'
df = pd.read_csv(filename)

In [2]:
df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30

In [3]:
df.dtypes

VendorID                   int64
tpep_pickup_datetime      object
tpep_dropoff_datetime     object
passenger_count            int64
trip_distance            float64
pickup_longitude         float64
pickup_latitude          float64
RateCodeID                 int64
store_and_fwd_flag        object
dropoff_longitude        float64
dropoff_latitude         float64
payment_type               int64
fare_amount              float64
extra                    float64
mta_tax                  float64
tip_amount               float64
tolls_amount             float64
improvement_surcharge    float64
total_amount             float64
dtype: object

In [4]:
# how much memory?

df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9999 entries, 0 to 9998
Data columns (total 19 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   VendorID               9999 non-null   int64
 1   tpep_pickup_datetime   9999 non-null   object
 2   tpep_dropoff_datetime  9999 non-null   object
 3   passenger_count        9999 non-null   int64
 4   trip_distance          9999 non-null   float64
 5   pickup_longitude       9999 non-null   float64
 6   pickup_latitude        9999 non-null   float64
 7   RateCodeID             9999 non-null   int64
 8   store_and_fwd_flag     9999 non-null   object
 9   dropoff_longitude      9999 non-null   float64
 10  dropoff_latitude       9999 non-null   float64
 11  payment_type           9999 non-null   int64
 12  fare_amount            9999 non-null   float64
 13  extra                  9999 non-null   float64
 14  mta_tax                9999 non-null   float64
 15  tip_amount             9999 non-null   float64
 16  tolls_amount           9999 non-null   float64
 17  improvement_surcharge  9999 non-null   float64
 18  total_amount           9999 non-null   float64
dtypes: float64(12), int64(4), object(3)
memory usage: 3.0 MB

In [5]:
# pd.to_datetime

pd.to_datetime(df['tpep_pickup_datetime'])

0      2015-06-02 11:19:29
1      2015-06-02 11:19:30
2      2015-06-02 11:19:31
3      2015-06-02 11:19:31
4      2015-06-02 11:19:32
               ...
9994   2015-06-01 00:12:59
9995   2015-06-01 00:12:59
9996   2015-06-01 00:13:00
9997   2015-06-01 00:13:02
9998   2015-06-01 00:13:04
Name: tpep_pickup_datetime, Length: 9999, dtype: datetime64[ns]

In [6]:
# assign back to the data frame

df['tpep_pickup_datetime'] = pd.to_datetime(df['tpep_pickup_datetime'])
df['tpep_dropoff_datetime'] = pd.to_datetime(df['tpep_dropoff_datetime'])

In [7]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9999 entries, 0 to 9998
Data columns (total 19 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   VendorID               9999 non-null   int64
 1   tpep_pickup_datetime   9999 non-null   datetime64[ns]
 2   tpep_dropoff_datetime  9999 non-null   datetime64[ns]
 3   passenger_count        9999 non-null   int64
 4   trip_distance          9999 non-null   float64
 5   pickup_longitude       9999 non-null   float64
 6   pickup_latitude        9999 non-null   float64
 7   RateCodeID             9999 non-null   int64
 8   store_and_fwd_flag     9999 non-null   object
 9   dropoff_longitude      9999 non-null   float64
 10  dropoff_latitude       9999 non-null   float64
 11  payment_type           9999 non-null   int64
 12  fare_amount            9999 non-null   float64
 13  extra                  9999 non-null   float64
 14  mta_tax                9999 non-null   float64
 15  tip_amount             9999 non-null   float64
 16  tolls_amount           9999 non-null   float64
 17  improvement_surcharge  9999 non-null   float64
 18  total_amount           9999 non-null   float64
dtypes: datetime64[ns](2), float64(12), int64(4), object(1)
memory usage: 1.9 MB

# What format?

- `YYYY-MM-DD HH:MM:SS` -- this works automatically
- `DD/MM/YYYY HH:MM:SS` -- works fine, if we pass `dayfirst=True`
- `MM/DD/YYYY HH:MM:SS` -- this works automatically

We can pass the `format` keyword argument, and pass a format string (https://strftime.org/)

In [10]:
df = (pd.
     read_csv(filename)
      .assign(tpep_pickup_datetime = lambda df_: pd.to_datetime(df_['tpep_pickup_datetime']),
              tpep_dropoff_datetime = lambda df_: pd.to_datetime(df_['tpep_dropoff_datetime']))
     )

In [11]:
df.dtypes

VendorID                          int64
tpep_pickup_datetime     datetime64[ns]
tpep_dropoff_datetime    datetime64[ns]
passenger_count                   int64
trip_distance                   float64
pickup_longitude                float64
pickup_latitude                 float64
RateCodeID                        int64
store_and_fwd_flag               object
dropoff_longitude               float64
dropoff_latitude                float64
payment_type                      int64
fare_amount                     float64
extra                           float64
mta_tax                         float64
tip_amount                      float64
tolls_amount                    float64
improvement_surcharge           float64
total_amount                    float64
dtype: object

In [13]:
# we can also use parse_dates

df = (pd.
     read_csv(filename,
              usecols=['tpep_pickup_datetime', 'tpep_dropoff_datetime',
                      'passenger_count', 'trip_distance', 'total_amount'],
             parse_dates=['tpep_pickup_datetime', 'tpep_dropoff_datetime'])
     )
df.dtypes

tpep_pickup_datetime     datetime64[ns]
tpep_dropoff_datetime    datetime64[ns]
passenger_count                   int64
trip_distance                   float64
total_amount                    float64
dtype: object

In [14]:
df.head(10)

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
0,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80
1,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00
3,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16
4,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30
5,2015-06-02 11:19:33,2015-06-02 11:28:48,1,1.40,10.55
6,2015-06-02 11:19:34,2015-06-02 11:38:46,1,1.80,16.30
7,2015-06-02 11:19:35,2015-06-02 12:36:46,4,11.90,73.84
8,2015-06-02 11:19:36,2015-06-02 11:45:19,1,1.27,15.80
9,2015-06-02 11:19:38,2015-06-02 11:23:50,1,0.60,6.30

# Usint `.dt`

We can use `.dt` on a `datetime` column and retrieve parts from it:

- `.dt.year`
- `.dt.month`
- `.dt.hour`

In [15]:
df['tpep_pickup_datetime'].dt.hour

0       11
1       11
2       11
3       11
4       11
        ..
9994     0
9995     0
9996     0
9997     0
9998     0
Name: tpep_pickup_datetime, Length: 9999, dtype: int32

In [16]:
df['tpep_dropoff_datetime'].dt.year

0       2015
1       2015
2       2015
3       2015
4       2015
        ...
9994    2015
9995    2015
9996    2015
9997    2015
9998    2015
Name: tpep_dropoff_datetime, Length: 9999, dtype: int32

In [18]:
df['tpep_dropoff_datetime'].dt.dayofweek.value_counts()

tpep_dropoff_datetime
1    4395
3    2536
0    2439
5     628
2       1
Name: count, dtype: int64

In [19]:
len(df.index)

9999

In [23]:
df['tpep_dropoff_datetime'].dt.day_name().value_counts()

tpep_dropoff_datetime
Tuesday      4395
Thursday     2536
Monday       2439
Saturday      628
Wednesday       1
Name: count, dtype: int64

In [26]:
dir(df['tpep_dropoff_datetime'].dt)

['__annotations__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__firstlineno__',
 '__format__',
 '__frozen',
 '__ge__',
 '__getattribute__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__static_attributes__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_accessors',
 '_add_delegate_accessors',
 '_constructor',
 '_delegate_method',
 '_delegate_property_get',
 '_delegate_property_set',
 '_dir_additions',
 '_dir_deletions',
 '_freeze',
 '_get_values',
 '_hidden_attrs',
 '_parent',
 '_reset_cache',
 'as_unit',
 'ceil',
 'date',
 'day',
 'day_name',
 'day_of_week',
 'day_of_year',
 'dayofweek',
 'dayofyear',
 'days_in_month',
 'daysinmonth',
 'floor',
 'freq',
 'hour',
 'is_leap_year',
 'is_month_end',
 'is_month_start',
 'is_quarter_end',
 'is_quarter_start',
 'is_year_end',
 'is_year_start',
 'isocalendar',
 'microsecond',
 'minute',
 'month',
 'month_name',
 'nanosecond',
 'normalize',
 'quarter',
 'round',
 'second',
 'strftime',
 'time',
 'timetz',
 'to_period',
 'to_pydatetime',
 'tz',
 'tz_convert',
 'tz_localize',
 'unit',
 'weekday',
 'year']

In [27]:
!ls *.zip

nyc_taxi_2020-07.zip  taxi.zip

# Exercise: NYC taxis

1. Read the NYC taxi data from July 2020 into a data frame without turning into `datetime` values. How big is it?
2. Use `parse_dates` to read it a second time. How much memory did you save?
3. How many rides were there on each day of the week?
4. How many rides were there on each hour?
5. What was the mean `trip_distance` on weekends vs. during the week?

In [29]:
filename = 'nyc_taxi_2020-07.zip'

df = pd.read_csv(filename, low_memory=False)

In [33]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800412 entries, 0 to 800411
Data columns (total 18 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   VendorID               737565 non-null  float64
 1   tpep_pickup_datetime   800412 non-null  object
 2   tpep_dropoff_datetime  800412 non-null  object
 3   passenger_count        737565 non-null  float64
 4   trip_distance          800412 non-null  float64
 5   RatecodeID             737565 non-null  float64
 6   store_and_fwd_flag     737565 non-null  object
 7   PULocationID           800412 non-null  int64
 8   DOLocationID           800412 non-null  int64
 9   payment_type           737565 non-null  float64
 10  fare_amount            800412 non-null  float64
 11  extra                  800412 non-null  float64
 12  mta_tax                800412 non-null  float64
 13  tip_amount             800412 non-null  float64
 14  tolls_amount           800412 non-null  float64
 15  improvement_surcharge  800412 non-null  float64
 16  total_amount           800412 non-null  float64
 17  congestion_surcharge   800412 non-null  float64
dtypes: float64(13), int64(2), object(3)
memory usage: 232.5 MB

In [34]:
filename = 'nyc_taxi_2020-07.zip'

df = pd.read_csv(filename, low_memory=False,
                parse_dates=['tpep_pickup_datetime', 'tpep_dropoff_datetime'])

In [35]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800412 entries, 0 to 800411
Data columns (total 18 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   VendorID               737565 non-null  float64
 1   tpep_pickup_datetime   800412 non-null  datetime64[ns]
 2   tpep_dropoff_datetime  800412 non-null  datetime64[ns]
 3   passenger_count        737565 non-null  float64
 4   trip_distance          800412 non-null  float64
 5   RatecodeID             737565 non-null  float64
 6   store_and_fwd_flag     737565 non-null  object
 7   PULocationID           800412 non-null  int64
 8   DOLocationID           800412 non-null  int64
 9   payment_type           737565 non-null  float64
 10  fare_amount            800412 non-null  float64
 11  extra                  800412 non-null  float64
 12  mta_tax                800412 non-null  float64
 13  tip_amount             800412 non-null  float64
 14  tolls_amount           800412 non-null  float64
 15  improvement_surcharge  800412 non-null  float64
 16  total_amount           800412 non-null  float64
 17  congestion_surcharge   800412 non-null  float64
dtypes: datetime64[ns](2), float64(13), int64(2), object(1)
memory usage: 140.9 MB

In [37]:
# 3. How many rides were there on each day of the week?

df['tpep_pickup_datetime'].dt.day_name().value_counts()

tpep_pickup_datetime
Thursday     149582
Wednesday    147489
Friday       136094
Tuesday      115951
Monday       106208
Saturday      79001
Sunday        66087
Name: count, dtype: int64

In [40]:
# 4. How many rides were there on each hour?

df['tpep_pickup_datetime'].dt.hour.value_counts(sort=False).sort_index()

tpep_pickup_datetime
0     11457
1      9581
2      7241
3      7157
4      7374
5      6807
6     18554
7     25889
8     35090
9     41009
10    46282
11    49846
12    54563
13    57580
14    59073
15    59210
16    57144
17    56668
18    53129
19    42472
20    30649
21    24662
22    20783
23    18192
Name: count, dtype: int64

In [50]:
# 5. What was the mean `trip_distance` on weekends vs. during the week?

(
    df
    .loc[
        df['tpep_pickup_datetime'].dt.day_of_week.isin([5,6]) ,
        'trip_distance'
    ]     # 0 == Monday
    .mean()
)

np.float64(6.915069750771945)

In [51]:
(
    df
    .loc[
        ~df['tpep_pickup_datetime'].dt.day_of_week.isin([5,6]) ,
        'trip_distance'
    ]     # 0 == Monday
    .mean()
)

np.float64(3.7261134644847442)

In [52]:
# what if I want to find out: for each separate hour of the day, what 
# was the mean distance?

df.groupby('passenger_count')['trip_distance'].mean()

passenger_count
0.0    2.629651
1.0    2.661786
2.0    2.914637
3.0    2.930557
4.0    3.032374
5.0    2.780181
6.0    2.823975
7.0    2.168000
8.0    0.000000
9.0    0.000000
Name: trip_distance, dtype: float64

In [55]:
(
    df
    .groupby(df['tpep_pickup_datetime'].dt.hour)
    ['trip_distance'].mean()
    .sort_values(ascending=False)
)

tpep_pickup_datetime
21    32.465414
1     15.018075
3     14.842060
4     13.844186
2      7.522501
0      4.686456
7      4.502182
23     4.159685
22     3.785870
5      3.669135
20     3.432630
13     3.229825
19     3.080243
17     3.006179
16     2.980572
18     2.958436
15     2.884645
6      2.877530
14     2.705078
12     2.635746
8      2.588864
11     2.570557
9      2.552402
10     2.525525
Name: trip_distance, dtype: float64

In [56]:
# groupby on two columns

(
    df
    .groupby([df['tpep_pickup_datetime'].dt.hour, 'passenger_count'])
    ['trip_distance'].mean()
    .sort_values(ascending=False)
)

tpep_pickup_datetime  passenger_count
20                    7.0                10.840000
3                     2.0                 5.271961
23                    5.0                 5.194554
3                     4.0                 4.964615
4                     2.0                 4.779444
                                           ...
0                     9.0                 0.000000
14                    7.0                 0.000000
22                    7.0                 0.000000
                      8.0                 0.000000
23                    8.0                 0.000000
Name: trip_distance, Length: 174, dtype: float64

In [61]:
# Grouper

(
    df
    # key == the column on which I want to run, on a datetime column
    # frequency == chunk size for the grouping
    .groupby(pd.Grouper(key='tpep_pickup_datetime', freq='1h'))
    ['trip_distance'].mean()
    .sort_values(ascending=False)
)

tpep_pickup_datetime
2020-07-26 21:00:00    289.939840
2020-07-23 01:00:00    284.695535
2020-07-18 21:00:00    274.503365
2020-07-09 21:00:00    273.676141
2020-07-03 03:00:00    162.823870
                          ...
2020-06-30 17:00:00           NaN
2020-06-30 19:00:00           NaN
2020-06-30 20:00:00           NaN
2020-06-30 21:00:00           NaN
2020-06-30 22:00:00           NaN
Name: trip_distance, Length: 101522, dtype: float64

# Exercise: More taxi stuff

1. From the July 2020 data, on which 5 days of the month did people travel the furthest on average?
2. At which hour do we see the greatest number of refunds (i.e., negative `total_amount`)?

In [64]:
(
    df
    .groupby(df['tpep_pickup_datetime'].dt.day)['trip_distance'].mean()
    .nlargest(5)
)

tpep_pickup_datetime
26    16.792579
18    15.146303
9     10.763637
23     5.460835
3      5.293490
Name: trip_distance, dtype: float64

In [69]:
(
    df
    .loc[lambda df_: df_['total_amount'] < 0]
    ['tpep_pickup_datetime'].dt.hour
    .value_counts()
)

tpep_pickup_datetime
15    290
17    256
13    251
14    246
18    242
16    235
19    216
12    208
20    205
10    181
11    177
21    156
9     153
23    132
22    113
8     111
0     101
6      91
7      87
1      70
2      56
5      54
4      35
3      31
Name: count, dtype: int64

# Next up

- `timedelta`
- time series
- resampling

In [70]:
# datetime - datetime = timedelta

df = pd.read_csv('taxi.csv',
                usecols=['tpep_pickup_datetime', 'tpep_dropoff_datetime',
                        'trip_distance', 'total_amount', 'passenger_count'],
                parse_dates=['tpep_pickup_datetime', 'tpep_dropoff_datetime'])
df.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
0,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80
1,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00
3,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16
4,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30

In [71]:
df['tpep_dropoff_datetime'] - df['tpep_pickup_datetime']

0      0 days 00:28:23
1      0 days 00:08:26
2      0 days 00:10:59
3      0 days 00:19:31
4      0 days 00:13:17
             ...
9994   0 days 00:11:19
9995   0 days 00:15:17
9996   0 days 00:24:25
9997   0 days 00:06:08
9998   0 days 00:23:29
Length: 9999, dtype: timedelta64[ns]

# `timedelta`

Timedelta is built from:

- ms
- seconds
- days

In [72]:
# how many trips were '0 days 00:23:29'

df['trip_time'] = df['tpep_dropoff_datetime'] - df['tpep_pickup_datetime']
df.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
0,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80,0 days 00:28:23
1,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30,0 days 00:08:26
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00,0 days 00:10:59
3,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16,0 days 00:19:31
4,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30,0 days 00:13:17

In [73]:
df.dtypes

tpep_pickup_datetime      datetime64[ns]
tpep_dropoff_datetime     datetime64[ns]
passenger_count                    int64
trip_distance                    float64
total_amount                     float64
trip_time                timedelta64[ns]
dtype: object

In [75]:
df.loc[df['trip_time'] == '0 days 00:23:29']

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
7050,2015-06-04 15:22:16,2015-06-04 15:45:45,1,7.4,36.40,0 days 00:23:29
7058,2015-06-04 15:22:21,2015-06-04 15:45:50,1,2.8,16.80,0 days 00:23:29
9998,2015-06-01 00:13:04,2015-06-01 00:36:33,1,5.8,26.75,0 days 00:23:29

In [76]:
# how many trips took more than 1 hour?
df.loc[df['trip_time'] > '01:00:00']

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
7,2015-06-02 11:19:35,2015-06-02 12:36:46,4,11.90,73.84,0 days 01:17:11
88,2015-06-02 11:20:37,2015-06-02 12:35:21,2,23.76,94.00,0 days 01:14:44
126,2015-06-02 11:21:03,2015-06-03 00:00:00,3,1.06,11.16,0 days 12:38:57
174,2015-06-02 11:21:42,2015-06-02 12:22:51,1,6.65,45.96,0 days 01:01:09
246,2015-06-02 11:19:46,2015-06-02 12:26:33,1,0.00,3.30,0 days 01:06:47
...,...,...,...,...,...,...
7907,2015-06-04 15:23:01,2015-06-04 16:30:03,1,26.60,96.84,0 days 01:07:02
8042,2015-06-06 16:53:20,2015-06-06 17:54:20,1,17.98,58.34,0 days 01:01:00
8171,2015-06-06 16:53:33,2015-06-06 18:01:48,1,18.01,58.34,0 days 01:08:15
8201,2015-06-06 16:53:56,2015-06-06 17:54:22,1,17.36,69.00,0 days 01:00:26
8513,2015-06-01 00:04:50,2015-06-01 01:31:44,1,60.30,160.05,0 days 01:26:54

In [79]:
# we can pass a string with a number + measure

df.loc[df['trip_time'] > '2 days']

Empty DataFrame
Columns: [tpep_pickup_datetime, tpep_dropoff_datetime, passenger_count, trip_distance, total_amount, trip_time]
Index: []

In [84]:
help(df['trip_time'].loc[0])

Help on Timedelta in module pandas._libs.tslibs.timedeltas object:

class Timedelta(_Timedelta)
 |  Timedelta(value=<object object at 0x1052c44a0>, unit=None, **kwargs)
 |
 |  Represents a duration, the difference between two dates or times.
 |
 |  Timedelta is the pandas equivalent of python's ``datetime.timedelta``
 |  and is interchangeable with it in most cases.
 |
 |  Parameters
 |  ----------
 |  value : Timedelta, timedelta, np.timedelta64, str, or int
 |  unit : str, default 'ns'
 |      Denote the unit of the input, if input is an integer.
 |
 |      Possible values:
 |
 |      * 'W', or 'D'
 |      * 'days', or 'day'
 |      * 'hours', 'hour', 'hr', or 'h'
 |      * 'minutes', 'minute', 'min', or 'm'
 |      * 'seconds', 'second', 'sec', or 's'
 |      * 'milliseconds', 'millisecond', 'millis', 'milli', or 'ms'
 |      * 'microseconds', 'microsecond', 'micros', 'micro', or 'us'
 |      * 'nanoseconds', 'nanosecond', 'nanos', 'nano', or 'ns'.
 |
 |      .. deprecated:: 2.2.0
 |
 |          Values `H`, `T`, `S`, `L`, `U`, and `N` are deprecated in favour
 |          of the values `h`, `min`, `s`, `ms`, `us`, and `ns`.
 |
 |  **kwargs
 |      Available kwargs: {days, seconds, microseconds,
 |      milliseconds, minutes, hours, weeks}.
 |      Values for construction in compat with datetime.timedelta.
 |      Numpy ints and floats will be coerced to python ints and floats.
 |
 |  Notes
 |  -----
 |  The constructor may take in either both values of value and unit or
 |  kwargs as above. Either one of them must be used during initialization
 |
 |  The ``.value`` attribute is always in ns.
 |
 |  If the precision is higher than nanoseconds, the precision of the duration is
 |  truncated to nanoseconds.
 |
 |  Examples
 |  --------
 |  Here we initialize Timedelta object with both value and unit
 |
 |  >>> td = pd.Timedelta(1, "d")
 |  >>> td
 |  Timedelta('1 days 00:00:00')
 |
 |  Here we initialize the Timedelta object with kwargs
 |
 |  >>> td2 = pd.Timedelta(days=1)
 |  >>> td2
 |  Timedelta('1 days 00:00:00')
 |
 |  We see that either way we get the same result
 |
 |  Method resolution order:
 |      Timedelta
 |      _Timedelta
 |      datetime.timedelta
 |      builtins.object
 |
 |  Methods defined here:
 |
 |  __abs__(self)
 |
 |  __add__(self, other)
 |
 |  __divmod__(self, other)
 |
 |  __floordiv__(self, other)
 |
 |  __mod__(self, other)
 |
 |  __mul__(self, other)
 |
 |  __neg__(self)
 |
 |  __pos__(self)
 |
 |  __radd__(self, other)
 |
 |  __rdivmod__(self, other)
 |
 |  __reduce__(self)
 |
 |  __rfloordiv__(self, other)
 |
 |  __rmod__(self, other)
 |
 |  __rmul__ = __mul__(self, other)
 |
 |  __rsub__(self, other)
 |
 |  __rtruediv__(self, other)
 |
 |  __setstate__(self, state)
 |
 |  __sub__(self, other)
 |
 |  __truediv__(self, other)
 |
 |  ceil(self, freq)
 |      Return a new Timedelta ceiled to this resolution.
 |
 |      Parameters
 |      ----------
 |      freq : str
 |          Frequency string indicating the ceiling resolution.
 |          It uses the same units as class constructor :class:`~pandas.Timedelta`.
 |
 |      Examples
 |      --------
 |      >>> td = pd.Timedelta('1001ms')
 |      >>> td
 |      Timedelta('0 days 00:00:01.001000')
 |      >>> td.ceil('s')
 |      Timedelta('0 days 00:00:02')
 |
 |  floor(self, freq)
 |      Return a new Timedelta floored to this resolution.
 |
 |      Parameters
 |      ----------
 |      freq : str
 |          Frequency string indicating the flooring resolution.
 |          It uses the same units as class constructor :class:`~pandas.Timedelta`.
 |
 |      Examples
 |      --------
 |      >>> td = pd.Timedelta('1001ms')
 |      >>> td
 |      Timedelta('0 days 00:00:01.001000')
 |      >>> td.floor('s')
 |      Timedelta('0 days 00:00:01')
 |
 |  round(self, freq)
 |      Round the Timedelta to the specified resolution.
 |
 |      Parameters
 |      ----------
 |      freq : str
 |          Frequency string indicating the rounding resolution.
 |          It uses the same units as class constructor :class:`~pandas.Timedelta`.
 |
 |      Returns
 |      -------
 |      a new Timedelta rounded to the given resolution of `freq`
 |
 |      Raises
 |      ------
 |      ValueError if the freq cannot be converted
 |
 |      Examples
 |      --------
 |      >>> td = pd.Timedelta('1001ms')
 |      >>> td
 |      Timedelta('0 days 00:00:01.001000')
 |      >>> td.round('s')
 |      Timedelta('0 days 00:00:01')
 |
 |  ----------------------------------------------------------------------
 |  Static methods defined here:
 |
 |  __new__(cls, value=<object object at 0x1052c44a0>, unit=None, **kwargs)
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors defined here:
 |
 |  __dict__
 |      dictionary for instance variables
 |
 |  __weakref__
 |      list of weak references to the object
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from _Timedelta:
 |
 |  __bool__(self, /)
 |      True if self else False
 |
 |  __eq__(self, value, /)
 |      Return self==value.
 |
 |  __ge__(self, value, /)
 |      Return self>=value.
 |
 |  __gt__(self, value, /)
 |      Return self>value.
 |
 |  __hash__(self, /)
 |      Return hash(self).
 |
 |  __le__(self, value, /)
 |      Return self<=value.
 |
 |  __lt__(self, value, /)
 |      Return self<value.
 |
 |  __ne__(self, value, /)
 |      Return self!=value.
 |
 |  __reduce_cython__(self)
 |
 |  __repr__(self, /)
 |      Return repr(self).
 |
 |  __setstate_cython__(self, __pyx_state)
 |
 |  __str__(self, /)
 |      Return str(self).
 |
 |  as_unit(self, unit, round_ok=True)
 |      Convert the underlying int64 representation to the given unit.
 |
 |      Parameters
 |      ----------
 |      unit : {"ns", "us", "ms", "s"}
 |      round_ok : bool, default True
 |          If False and the conversion requires rounding, raise.
 |
 |      Returns
 |      -------
 |      Timedelta
 |
 |      Examples
 |      --------
 |      >>> td = pd.Timedelta('1001ms')
 |      >>> td
 |      Timedelta('0 days 00:00:01.001000')
 |      >>> td.as_unit('s')
 |      Timedelta('0 days 00:00:01')
 |
 |  isoformat(self) -> 'str'
 |      Format the Timedelta as ISO 8601 Duration.
 |
 |      ``P[n]Y[n]M[n]DT[n]H[n]M[n]S``, where the ``[n]`` s are replaced by the
 |      values. See https://en.wikipedia.org/wiki/ISO_8601#Durations.
 |
 |      Returns
 |      -------
 |      str
 |
 |      See Also
 |      --------
 |      Timestamp.isoformat : Function is used to convert the given
 |          Timestamp object into the ISO format.
 |
 |      Notes
 |      -----
 |      The longest component is days, whose value may be larger than
 |      365.
 |      Every component is always included, even if its value is 0.
 |      Pandas uses nanosecond precision, so up to 9 decimal places may
 |      be included in the seconds component.
 |      Trailing 0's are removed from the seconds component after the decimal.
 |      We do not 0 pad components, so it's `...T5H...`, not `...T05H...`
 |
 |      Examples
 |      --------
 |      >>> td = pd.Timedelta(days=6, minutes=50, seconds=3,
 |      ...                   milliseconds=10, microseconds=10, nanoseconds=12)
 |
 |      >>> td.isoformat()
 |      'P6DT0H50M3.010010012S'
 |      >>> pd.Timedelta(hours=1, seconds=10).isoformat()
 |      'P0DT1H0M10S'
 |      >>> pd.Timedelta(days=500.5).isoformat()
 |      'P500DT12H0M0S'
 |
 |  to_numpy(self, dtype=None, copy=False) -> 'np.timedelta64'
 |      Convert the Timedelta to a NumPy timedelta64.
 |
 |      This is an alias method for `Timedelta.to_timedelta64()`. The dtype and
 |      copy parameters are available here only for compatibility. Their values
 |      will not affect the return value.
 |
 |      Returns
 |      -------
 |      numpy.timedelta64
 |
 |      See Also
 |      --------
 |      Series.to_numpy : Similar method for Series.
 |
 |      Examples
 |      --------
 |      >>> td = pd.Timedelta('3D')
 |      >>> td
 |      Timedelta('3 days 00:00:00')
 |      >>> td.to_numpy()
 |      numpy.timedelta64(259200000000000,'ns')
 |
 |  to_pytimedelta(self)
 |      Convert a pandas Timedelta object into a python ``datetime.timedelta`` object.
 |
 |      Timedelta objects are internally saved as numpy datetime64[ns] dtype.
 |      Use to_pytimedelta() to convert to object dtype.
 |
 |      Returns
 |      -------
 |      datetime.timedelta or numpy.array of datetime.timedelta
 |
 |      See Also
 |      --------
 |      to_timedelta : Convert argument to Timedelta type.
 |
 |      Notes
 |      -----
 |      Any nanosecond resolution will be lost.
 |
 |      Examples
 |      --------
 |      >>> td = pd.Timedelta('3D')
 |      >>> td
 |      Timedelta('3 days 00:00:00')
 |      >>> td.to_pytimedelta()
 |      datetime.timedelta(days=3)
 |
 |  to_timedelta64(self) -> 'np.timedelta64'
 |      Return a numpy.timedelta64 object with 'ns' precision.
 |
 |      Examples
 |      --------
 |      >>> td = pd.Timedelta('3D')
 |      >>> td
 |      Timedelta('3 days 00:00:00')
 |      >>> td.to_timedelta64()
 |      numpy.timedelta64(259200000000000,'ns')
 |
 |  total_seconds(self) -> 'float'
 |      Total seconds in the duration.
 |
 |      Examples
 |      --------
 |      >>> td = pd.Timedelta('1min')
 |      >>> td
 |      Timedelta('0 days 00:01:00')
 |      >>> td.total_seconds()
 |      60.0
 |
 |  view(self, dtype)
 |      Array view compatibility.
 |
 |      Parameters
 |      ----------
 |      dtype : str or dtype
 |          The dtype to view the underlying data as.
 |
 |      Examples
 |      --------
 |      >>> td = pd.Timedelta('3D')
 |      >>> td
 |      Timedelta('3 days 00:00:00')
 |      >>> td.view(int)
 |      259200000000000
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from _Timedelta:
 |
 |  asm8
 |      Return a numpy timedelta64 array scalar view.
 |
 |      Provides access to the array scalar view (i.e. a combination of the
 |      value and the units) associated with the numpy.timedelta64().view(),
 |      including a 64-bit integer representation of the timedelta in
 |      nanoseconds (Python int compatible).
 |
 |      Returns
 |      -------
 |      numpy timedelta64 array scalar view
 |          Array scalar view of the timedelta in nanoseconds.
 |
 |      Examples
 |      --------
 |      >>> td = pd.Timedelta('1 days 2 min 3 us 42 ns')
 |      >>> td.asm8
 |      numpy.timedelta64(86520000003042,'ns')
 |
 |      >>> td = pd.Timedelta('2 min 3 s')
 |      >>> td.asm8
 |      numpy.timedelta64(123000000000,'ns')
 |
 |      >>> td = pd.Timedelta('3 ms 5 us')
 |      >>> td.asm8
 |      numpy.timedelta64(3005000,'ns')
 |
 |      >>> td = pd.Timedelta(42, unit='ns')
 |      >>> td.asm8
 |      numpy.timedelta64(42,'ns')
 |
 |  components
 |      Return a components namedtuple-like.
 |
 |      Examples
 |      --------
 |      >>> td = pd.Timedelta('2 day 4 min 3 us 42 ns')
 |      >>> td.components
 |      Components(days=2, hours=0, minutes=4, seconds=0, milliseconds=0,
 |          microseconds=3, nanoseconds=42)
 |
 |  days
 |      Returns the days of the timedelta.
 |
 |      Returns
 |      -------
 |      int
 |
 |      Examples
 |      --------
 |      >>> td = pd.Timedelta(1, "d")
 |      >>> td.days
 |      1
 |
 |      >>> td = pd.Timedelta('4 min 3 us 42 ns')
 |      >>> td.days
 |      0
 |
 |  microseconds
 |      Number of microseconds (>= 0 and less than 1 second).
 |
 |  nanoseconds
 |      Return the number of nanoseconds (n), where 0 <= n < 1 microsecond.
 |
 |      Returns
 |      -------
 |      int
 |          Number of nanoseconds.
 |
 |      See Also
 |      --------
 |      Timedelta.components : Return all attributes with assigned values
 |          (i.e. days, hours, minutes, seconds, milliseconds, microseconds,
 |          nanoseconds).
 |
 |      Examples
 |      --------
 |      **Using string input**
 |
 |      >>> td = pd.Timedelta('1 days 2 min 3 us 42 ns')
 |
 |      >>> td.nanoseconds
 |      42
 |
 |      **Using integer input**
 |
 |      >>> td = pd.Timedelta(42, unit='ns')
 |      >>> td.nanoseconds
 |      42
 |
 |  resolution_string
 |      Return a string representing the lowest timedelta resolution.
 |
 |      Each timedelta has a defined resolution that represents the lowest OR
 |      most granular level of precision. Each level of resolution is
 |      represented by a short string as defined below:
 |
 |      Resolution:     Return value
 |
 |      * Days:         'D'
 |      * Hours:        'h'
 |      * Minutes:      'min'
 |      * Seconds:      's'
 |      * Milliseconds: 'ms'
 |      * Microseconds: 'us'
 |      * Nanoseconds:  'ns'
 |
 |      Returns
 |      -------
 |      str
 |          Timedelta resolution.
 |
 |      Examples
 |      --------
 |      >>> td = pd.Timedelta('1 days 2 min 3 us 42 ns')
 |      >>> td.resolution_string
 |      'ns'
 |
 |      >>> td = pd.Timedelta('1 days 2 min 3 us')
 |      >>> td.resolution_string
 |      'us'
 |
 |      >>> td = pd.Timedelta('2 min 3 s')
 |      >>> td.resolution_string
 |      's'
 |
 |      >>> td = pd.Timedelta(36, unit='us')
 |      >>> td.resolution_string
 |      'us'
 |
 |  seconds
 |      Return the total hours, minutes, and seconds of the timedelta as seconds.
 |
 |      Timedelta.seconds = hours * 3600 + minutes * 60 + seconds.
 |
 |      Returns
 |      -------
 |      int
 |          Number of seconds.
 |
 |      See Also
 |      --------
 |      Timedelta.components : Return all attributes with assigned values
 |          (i.e. days, hours, minutes, seconds, milliseconds, microseconds,
 |          nanoseconds).
 |      Timedelta.total_seconds : Express the Timedelta as total number of seconds.
 |
 |      Examples
 |      --------
 |      **Using string input**
 |
 |      >>> td = pd.Timedelta('1 days 2 min 3 us 42 ns')
 |      >>> td.seconds
 |      120
 |
 |      **Using integer input**
 |
 |      >>> td = pd.Timedelta(42, unit='s')
 |      >>> td.seconds
 |      42
 |
 |  unit
 |
 |  value
 |
 |  ----------------------------------------------------------------------
 |  Data and other attributes inherited from _Timedelta:
 |
 |  __array_priority__ = 100
 |
 |  __pyx_vtable__ = <capsule object NULL>
 |
 |  max = Timedelta('106751 days 23:47:16.854775807')
 |
 |  min = Timedelta('-106752 days +00:12:43.145224193')
 |
 |  resolution = Timedelta('0 days 00:00:00.000000001')

# Exercise: time delta comparisons

1. With our data frame using taxi data from July 2020, create a `trip_time` column, a `timedelta` series.
2. How many trips took longer than 12 hours? How much did they pay, on average? How far did they go, on average?
3. How many trips took less than 1 minute? Again, how much did they pay and how far did they go?
4. What was the longest trip, in terms of time?

In [90]:
filename = 'nyc_taxi_2020-07.zip'

df = pd.read_csv(filename, low_memory=False,
                 usecols=['tpep_pickup_datetime', 'tpep_dropoff_datetime',
                         'passenger_count', 'trip_distance', 'total_amount'],
                parse_dates=['tpep_pickup_datetime', 'tpep_dropoff_datetime'])

In [91]:
df['trip_time'] = df['tpep_dropoff_datetime'] - df['tpep_pickup_datetime']
df.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
0,2020-07-01 00:25:32,2020-07-01 00:33:39,1.0,1.50,9.30,0 days 00:08:07
1,2020-07-01 00:03:19,2020-07-01 00:25:43,1.0,9.50,27.80,0 days 00:22:24
2,2020-07-01 00:15:11,2020-07-01 00:29:24,1.0,5.85,22.30,0 days 00:14:13
3,2020-07-01 00:30:49,2020-07-01 00:38:26,1.0,1.90,14.16,0 days 00:07:37
4,2020-07-01 00:31:26,2020-07-01 00:38:02,1.0,1.25,7.80,0 days 00:06:36

In [100]:
# 2. How many trips took longer than 12 hours? How much did they pay, on average? How far did they go, on average?

(
    df
    .loc[lambda df_: df_['trip_time'] > '12 hours'
    ,
    'total_amount']
    .median()
)

np.float64(15.8)

In [98]:
# 3. How many trips took less than 1 minute? Again, how much did they pay and how far did they go?
(
    df
    .loc[lambda df_: df_['trip_time'] < '1 minute'
    ,
    'total_amount']
    .median()
)

np.float64(6.3)

In [103]:
# 4. What was the longest trip, in terms of time?

df.loc[df['trip_time'].idxmax()]

tpep_pickup_datetime     2020-07-24 14:44:01
tpep_dropoff_datetime    2020-07-27 10:28:06
passenger_count                          1.0
trip_distance                           1.18
total_amount                            25.2
trip_time                    2 days 19:44:05
Name: 534889, dtype: object

In [104]:
df.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount,trip_time
0,2020-07-01 00:25:32,2020-07-01 00:33:39,1.0,1.50,9.30,0 days 00:08:07
1,2020-07-01 00:03:19,2020-07-01 00:25:43,1.0,9.50,27.80,0 days 00:22:24
2,2020-07-01 00:15:11,2020-07-01 00:29:24,1.0,5.85,22.30,0 days 00:14:13
3,2020-07-01 00:30:49,2020-07-01 00:38:26,1.0,1.90,14.16,0 days 00:07:37
4,2020-07-01 00:31:26,2020-07-01 00:38:02,1.0,1.25,7.80,0 days 00:06:36

In [106]:
df[['trip_distance', 'total_amount']].corr()

               trip_distance  total_amount
trip_distance        1.00000       0.00866
total_amount         0.00866       1.00000

In [107]:
df['total_amount'].nlargest(10)

420380    1995.00
99235     1108.99
31607     1010.80
664007     999.38
310088     887.45
377408     850.30
178517     794.67
479860     783.36
479909     783.36
101026     671.46
Name: total_amount, dtype: float64

In [108]:
df['trip_distance'].nlargest(10)

797340    256069.13
781508    231147.49
764403    222795.31
774925     75085.39
769037     40266.38
745334     38184.62
788117     36124.95
779653     30668.46
797638      2214.48
693769       414.40
Name: trip_distance, dtype: float64

In [113]:
# remove all of the high outliers
df = df.loc[df['trip_distance'] < df['trip_distance'].quantile(0.999)]

In [122]:
df[['trip_distance', 'total_amount']].corr()

               trip_distance  total_amount
trip_distance       1.000000      0.842338
total_amount        0.842338      1.000000

In [117]:
df['trip_time'].dt.seconds.max()

np.int32(86396)

In [120]:
df['trip_time'].dt.total_seconds().max()

np.float64(243845.0)

In [123]:
df['total_seconds'] = df['trip_time'].dt.total_seconds()

/var/folders/d9/v8tsklln4477fll05wkgcpth0000gn/T/ipykernel_37225/2812211967.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['total_seconds'] = df['trip_time'].dt.total_seconds()

In [125]:
df[['trip_distance', 'total_amount', 'total_seconds']].corr()

               trip_distance  total_amount  total_seconds
trip_distance       1.000000      0.842338       0.012550
total_amount        0.842338      1.000000       0.012637
total_seconds       0.012550      0.012637       1.000000

In [126]:
# remove all of the high outliers for time
df = df.loc[df['total_seconds'] < df['total_seconds'].quantile(0.999)]

In [127]:
df[['trip_distance', 'total_amount', 'total_seconds']].corr()

               trip_distance  total_amount  total_seconds
trip_distance       1.000000      0.842258       0.011759
total_amount        0.842258      1.000000       0.012037
total_seconds       0.011759      0.012037       1.000000

In [128]:
# remove all of the high outliers for time
df = df.loc[df['total_seconds'] >= 0]

In [129]:
df[['trip_distance', 'total_amount', 'total_seconds']].corr()

               trip_distance  total_amount  total_seconds
trip_distance       1.000000      0.842258       0.221718
total_amount        0.842258      1.000000       0.225321
total_seconds       0.221718      0.225321       1.000000

In [130]:
df[['passenger_count', 'trip_distance', 'total_amount', 'total_seconds']].corr()

                 passenger_count  trip_distance  total_amount  total_seconds
passenger_count         1.000000       0.021945      0.005713       0.008037
trip_distance           0.021945       1.000000      0.842258       0.221718
total_amount            0.005713       0.842258      1.000000       0.225321
total_seconds           0.008037       0.221718      0.225321       1.000000

In [131]:
help(df.corr)

Help on method corr in module pandas.core.frame:

corr(
    method: 'CorrelationMethod' = 'pearson',
    min_periods: 'int' = 1,
    numeric_only: 'bool' = False
) -> 'DataFrame' method of pandas.core.frame.DataFrame instance
    Compute pairwise correlation of columns, excluding NA/null values.

    Parameters
    ----------
    method : {'pearson', 'kendall', 'spearman'} or callable
        Method of correlation:

        * pearson : standard correlation coefficient
        * kendall : Kendall Tau correlation coefficient
        * spearman : Spearman rank correlation
        * callable: callable with input two 1d ndarrays
            and returning a float. Note that the returned matrix from corr
            will have 1 along the diagonals and will be symmetric
            regardless of the callable's behavior.
    min_periods : int, optional
        Minimum number of observations required per pair of columns
        to have a valid result. Currently only available for Pearson
        and Spearman correlation.
    numeric_only : bool, default False
        Include only `float`, `int` or `boolean` data.

        .. versionadded:: 1.5.0

        .. versionchanged:: 2.0.0
            The default value of ``numeric_only`` is now ``False``.

    Returns
    -------
    DataFrame
        Correlation matrix.

    See Also
    --------
    DataFrame.corrwith : Compute pairwise correlation with another
        DataFrame or Series.
    Series.corr : Compute the correlation between two Series.

    Notes
    -----
    Pearson, Kendall and Spearman correlation are currently computed using pairwise complete observations.

    * `Pearson correlation coefficient <https://en.wikipedia.org/wiki/Pearson_correlation_coefficient>`_
    * `Kendall rank correlation coefficient <https://en.wikipedia.org/wiki/Kendall_rank_correlation_coefficient>`_
    * `Spearman's rank correlation coefficient <https://en.wikipedia.org/wiki/Spearman%27s_rank_correlation_coefficient>`_

    Examples
    --------
    >>> def histogram_intersection(a, b):
    ...     v = np.minimum(a, b).sum().round(decimals=1)
    ...     return v
    >>> df = pd.DataFrame([(.2, .3), (.0, .6), (.6, .0), (.2, .1)],
    ...                   columns=['dogs', 'cats'])
    >>> df.corr(method=histogram_intersection)
          dogs  cats
    dogs   1.0   0.3
    cats   0.3   1.0

    >>> df = pd.DataFrame([(1, 1), (2, np.nan), (np.nan, 3), (4, 4)],
    ...                   columns=['dogs', 'cats'])
    >>> df.corr(min_periods=3)
          dogs  cats
    dogs   1.0   NaN
    cats   NaN   1.0

In [132]:
df = pd.read_csv('taxi.csv',
                 parse_dates=['tpep_pickup_datetime', 'tpep_dropoff_datetime'],
                 usecols=['tpep_pickup_datetime', 'tpep_dropoff_datetime',
                         'passenger_count', 'trip_distance', 'total_amount'])
df.head()

,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
0,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80
1,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00
3,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16
4,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30

In [133]:
# take a datetime column , and make it the index

df = df.set_index('tpep_pickup_datetime')
df.head()

,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
tpep_pickup_datetime,,,,
2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80
2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30
2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00
2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16
2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30

In [134]:
df.loc['2015-06-02 11:19:29']

,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
tpep_pickup_datetime,,,,
2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.8
2015-06-02 11:19:29,2015-06-02 11:26:06,1,1.10,7.3
2015-06-02 11:19:29,2015-06-02 11:22:47,1,0.40,4.8

In [135]:
# remove the seconds, and it matches any value
df.loc['2015-06-02 11:19']

,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
tpep_pickup_datetime,,,,
2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80
2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30
2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00
2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16
2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30
...,...,...,...,...
2015-06-02 11:19:56,2015-06-02 11:24:18,1,0.60,7.80
2015-06-02 11:19:57,2015-06-02 11:26:37,1,0.90,8.16
2015-06-02 11:19:58,2015-06-02 11:27:59,1,0.90,9.80
2015-06-02 11:19:59,2015-06-02 11:39:51,1,2.01,16.80
2015-06-02 11:19:59,2015-06-02 11:37:33,5,1.74,16.00

In [136]:
df.loc['2015-06-02 11']

,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
tpep_pickup_datetime,,,,
2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80
2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30
2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00
2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16
2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30
...,...,...,...,...
2015-06-02 11:33:35,2015-06-02 11:42:16,1,0.73,7.80
2015-06-02 11:33:35,2015-06-02 11:38:53,1,0.96,8.50
2015-06-02 11:33:36,2015-06-02 11:52:32,2,3.50,18.80
2015-06-02 11:33:35,2015-06-02 11:55:02,5,2.14,14.80
2015-06-02 11:33:30,2015-06-02 11:42:45,5,0.61,7.80

In [140]:
# use a slice to grab between times

(
    df
    .sort_index()
    .loc['2015-06-02 11:19:20':'2015-06-02 11:19:40']
)

,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
tpep_pickup_datetime,,,,
2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,17.80
2015-06-02 11:19:29,2015-06-02 11:26:06,1,1.10,7.30
2015-06-02 11:19:29,2015-06-02 11:22:47,1,0.40,4.80
2015-06-02 11:19:30,2015-06-02 11:36:31,5,2.14,12.80
2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,8.30
2015-06-02 11:19:30,2015-06-02 11:27:01,1,0.50,8.30
2015-06-02 11:19:31,2015-06-02 11:27:59,1,1.20,8.30
2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,11.00
2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,17.16
2015-06-02 11:19:31,2015-06-02 11:31:41,1,1.00,13.80
2015-06-02 11:19:31,2015-06-02 11:48:02,1,4.76,45.30
2015-06-02 11:19:31,2015-06-02 11:31:30,1,1.10,11.30
2015-06-02 11:19:31,2015-06-02 11:31:24,1,3.65,13.30
2015-06-02 11:19:31,2015-06-02 11:28:41,1,0.70,7.80
2015-06-02 11:19:32,2015-06-02 11:41:50,1,1.68,18.36
2015-06-02 11:19:32,2015-06-02 11:30:07,1,1.00,8.80
2015-06-02 11:19:32,2015-06-02 11:27:28,1,1.10,7.80
2015-06-02 11:19:32,2015-06-02 11:38:08,3,2.10,16.55
2015-06-02 11:19:32,2015-06-02 11:36:04,6,4.20,17.30
2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,10.30
2015-06-02 11:19:33,2015-06-02 11:38:29,1,2.05,13.80
2015-06-02 11:19:33,2015-06-02 11:28:48,1,1.40,10.55
2015-06-02 11:19:33,2015-06-02 11:33:52,4,1.10,10.80
2015-06-02 11:19:34,2015-06-02 11:51:06,2,2.39,22.30
2015-06-02 11:19:34,2015-06-02 11:28:07,1,1.27,9.30
2015-06-02 11:19:34,2015-06-02 11:38:46,1,1.80,16.30
2015-06-02 11:19:35,2015-06-02 11:27:00,1,1.10,9.35
2015-06-02 11:19:35,2015-06-02 11:34:16,6,1.78,11.30
2015-06-02 11:19:35,2015-06-02 11:34:06,1,1.60,13.55
2015-06-02 11:19:35,2015-06-02 12:36:46,4,11.90,73.84
2015-06-02 11:19:35,2015-06-02 11:30:45,2,1.20,11.16
2015-06-02 11:19:36,2015-06-02 11:31:35,1,0.96,10.30
2015-06-02 11:19:36,2015-06-02 11:45:19,1,1.27,15.80
2015-06-02 11:19:36,2015-06-02 11:57:08,1,3.20,23.30
2015-06-02 11:19:37,2015-06-02 11:36:20,3,0.80,14.15
2015-06-02 11:19:37,2015-06-02 11:24:08,1,0.50,5.80
2015-06-02 11:19:38,2015-06-02 11:30:15,1,1.57,11.16
2015-06-02 11:19:38,2015-06-02 11:23:13,1,0.72,5.80
2015-06-02 11:19:38,2015-06-02 12:08:41,1,11.10,56.19
2015-06-02 11:19:38,2015-06-02 11:19:43,3,0.01,52.80
2015-06-02 11:19:38,2015-06-02 11:23:50,1,0.60,6.30
2015-06-02 11:19:38,2015-06-02 12:13:33,2,11.16,59.21
2015-06-02 11:19:38,2015-06-02 11:24:09,1,1.70,9.35
2015-06-02 11:19:39,2015-06-02 12:11:40,1,18.32,61.94
2015-06-02 11:19:39,2015-06-02 11:44:31,1,1.22,19.56
2015-06-02 11:19:39,2015-06-02 11:32:05,1,1.10,9.80
2015-06-02 11:19:39,2015-06-02 11:33:27,1,1.32,12.36
2015-06-02 11:19:39,2015-06-02 11:36:43,1,1.65,14.80
2015-06-02 11:19:40,2015-06-02 11:52:27,1,4.45,22.80
2015-06-02 11:19:40,2015-06-02 11:26:04,1,0.99,8.16
2015-06-02 11:19:40,2015-06-02 11:34:34,1,1.14,11.30
2015-06-02 11:19:40,2015-06-02 11:29:04,1,0.90,8.30

# Exercise: Time series

1. Use the July 2020 taxi data.
2. What was the mean `total_amount` and `trip_distance` for 2-person trips between 3:00 on July 5 and 16:00 on July 10th?
3. Count the number of taxi rides on July 14th.

In [142]:
filename = 'nyc_taxi_2020-07.zip'

df = pd.read_csv(filename, low_memory=False,
                 usecols=['tpep_pickup_datetime', 'tpep_dropoff_datetime',
                         'passenger_count', 'trip_distance', 'total_amount'],
                parse_dates=['tpep_pickup_datetime', 'tpep_dropoff_datetime'])

In [145]:
# 2. What was the mean `total_amount` and `trip_distance` for 2-person trips between 
# 3:00 on July 5 and 16:00 on July 10th?

(
    df
    .loc[lambda df_: df_['passenger_count'] == 2]
    .set_index('tpep_pickup_datetime')
    .sort_index()
    .loc['']
)

,tpep_dropoff_datetime,passenger_count,trip_distance,total_amount
tpep_pickup_datetime,,,,
2020-07-01 00:01:40,2020-07-01 00:12:19,2.0,2.40,14.75
2020-07-01 00:03:02,2020-07-01 00:07:35,2.0,2.39,14.76
2020-07-01 00:04:26,2020-07-01 00:17:19,2.0,2.40,12.30
2020-07-01 00:05:01,2020-07-01 00:24:49,2.0,9.20,28.80
2020-07-01 00:07:57,2020-07-01 00:14:42,2.0,1.70,11.30
...,...,...,...,...
2020-07-31 23:56:58,2020-07-31 23:59:20,2.0,0.70,9.75
2020-07-31 23:57:24,2020-08-01 00:14:04,2.0,8.42,31.92
2020-07-31 23:57:50,2020-08-01 00:14:21,2.0,4.10,19.80
2020-07-31 23:58:12,2020-08-01 00:00:43,2.0,0.90,9.80
2020-07-31 23:59:35,2020-08-01 00:03:26,2.0,1.30,11.75

In [ ]:
# 3. Count the number of taxi rides on July 14th.